#https://medium.com/@chris_bour/6-differences-between-pandas-and-spark-dataframes-1380cec394d2

PANDAS:
DATA INPUT AND OUTPUT
INDEXING AND FILTERING
WORKING WITH GROUPS
CREATING PLOTS

DATA TYPES IN PANDAS,IT'S I/O CAPABILITY,GROUPS,FILTERING AND PLOTTING


SAY EXAMPLE OF SALES DECOMP: LARGE CSV HAD TO BE TRANFORMED INTO COMPONENETS WE RELIED HEAVILY ON PANDAS AND IT WAS VERY USEFUL

WHAT MAKE SIT SO GREAT?
IT HAS VERY GOOD DATA FROMATS- JUST LIKE A RELATIONAL DB
EASY TO TRANDFORM DATA
EASY TO VISUALISE
EASY TO USE OTHER LIBRARIES


SEVERAL ROUTINE SIN NUMPY THAT SIMPLIFY WORKING ON PANDAS

3 DATA TYPES YOU MUST BE FAMILIAR WITH
np.array and np.ndarray pandas uses this under the hood and we wuse it explicitely too
pd.Series : this represents data set in a single column
pd.DataFrame : table like multi columnnar data

In [1]:
import pandas as pd
import numpy as np
import os
import json

In [2]:
#first create numpy array with 3elements random numbers, you can do it in pandas bt esier in numpy
my_df = pd.DataFrame(np.random.rand(3,2))

In [3]:
my_df

          0         1
0  0.171651  0.731235
1  0.660383  0.623469
2  0.103567  0.878158

In [4]:
#numpy has a nd array,a basic one d numpy array has a structure like list
#if you put this in a series, we get row labels in addition to this
#A data frame has columen labes too

In [5]:
my_numpy_array = np.random.rand(3)

In [6]:
my_numpy_array

array([ 0.02778674,  0.68307599,  0.33161979])

In [7]:
type(my_numpy_array)

numpy.ndarray

In [8]:
my_numpy_array[1]

0.68307599446058753

In [9]:
my_series = pd.Series(my_numpy_array)

In [10]:
my_series

0    0.027787
1    0.683076
2    0.331620
dtype: float64

In [11]:
my_series = pd.Series(my_numpy_array,index=["First","Second","Third"])

In [12]:
my_series

First     0.027787
Second    0.683076
Third     0.331620
dtype: float64

In [13]:
my_series[1]

0.68307599446058753

In [14]:
my_series

First     0.027787
Second    0.683076
Third     0.331620
dtype: float64

In [15]:
my_series.convert_objects(convert_numeric=True)

/home/vijay/anaconda2/envs/py35/lib/python3.5/site-packages/ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

First     0.027787
Second    0.683076
Third     0.331620
dtype: float64

In [16]:
my_series["Second"]

0.68307599446058753

In [17]:
my_series.index

Index(['First', 'Second', 'Third'], dtype='object')

In [18]:
#what if you have more columns,well use df

In [19]:
array_2d =  np.random.rand(3,2)

In [20]:
array_2d[0,1]

0.58334584312016813

In [21]:
df = pd.DataFrame(array_2d)

In [22]:
df

          0         1
0  0.648306  0.583346
1  0.792674  0.271464
2  0.628228  0.206365

In [23]:
# use column properties
df.columns

RangeIndex(start=0, stop=2, step=1)

In [24]:
df.columns = ["first","second"]

In [25]:
df

      first    second
0  0.648306  0.583346
1  0.792674  0.271464
2  0.628228  0.206365

In [26]:
df["second"] # since this is no longer  a df it's a series

0    0.583346
1    0.271464
2    0.206365
Name: second, dtype: float64

In [27]:
csv_path = "collection/artwork_data.csv"

In [28]:
#read just 5 rows,pandas does not do lazy evaluation
#%timeit 
df = pd.read_csv(csv_path,nrows=5)

In [29]:
df

,id,accession_number,artist,artistRole,artistId,title,dateText,medium,creditLine,year,acquisitionYear,dimensions,width,height,depth,units,inscription,thumbnailCopyright,thumbnailUrl,url
0,1035,A00001,"Blake, Robert",artist,38,A Figure Bowing before a Seated Old Man with h...,date not known,"Watercolour, ink, chalk and graphite on paper....",Presented by Mrs John Richmond 1922,NaN,1922,support: 394 x 419 mm,394,419,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-a-fi...
1,1036,A00002,"Blake, Robert",artist,38,"Two Drawings of Frightened Figures, Probably f...",date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 311 x 213 mm,311,213,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-two-...
2,1037,A00003,"Blake, Robert",artist,38,The Preaching of Warning. Verso: An Old Man En...,?c.1785,Graphite on paper. Verso: graphite on paper,Presented by Mrs John Richmond 1922,1785.0,1922,support: 343 x 467 mm,343,467,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...
3,1038,A00004,"Blake, Robert",artist,38,Six Drawings of Figures with Outstretched Arms,date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 318 x 394 mm,318,394,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-six-...
4,1039,A00005,"Blake, William",artist,39,The Circle of the Lustful: Francesca da Rimini...,"1826–7, reprinted 1892",Line engraving on paper,Purchased with the assistance of a special gra...,1826.0,1919,image: 243 x 335 mm,243,335,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...

In [30]:
df = pd.read_csv(csv_path,nrows=5,index_col='id')

In [31]:
df

,accession_number,artist,artistRole,artistId,title,dateText,medium,creditLine,year,acquisitionYear,dimensions,width,height,depth,units,inscription,thumbnailCopyright,thumbnailUrl,url
id,,,,,,,,,,,,,,,,,,,
1035,A00001,"Blake, Robert",artist,38,A Figure Bowing before a Seated Old Man with h...,date not known,"Watercolour, ink, chalk and graphite on paper....",Presented by Mrs John Richmond 1922,NaN,1922,support: 394 x 419 mm,394,419,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-a-fi...
1036,A00002,"Blake, Robert",artist,38,"Two Drawings of Frightened Figures, Probably f...",date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 311 x 213 mm,311,213,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-two-...
1037,A00003,"Blake, Robert",artist,38,The Preaching of Warning. Verso: An Old Man En...,?c.1785,Graphite on paper. Verso: graphite on paper,Presented by Mrs John Richmond 1922,1785.0,1922,support: 343 x 467 mm,343,467,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...
1038,A00004,"Blake, Robert",artist,38,Six Drawings of Figures with Outstretched Arms,date not known,Graphite on paper,Presented by Mrs John Richmond 1922,NaN,1922,support: 318 x 394 mm,318,394,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-six-...
1039,A00005,"Blake, William",artist,39,The Circle of the Lustful: Francesca da Rimini...,"1826–7, reprinted 1892",Line engraving on paper,Purchased with the assistance of a special gra...,1826.0,1919,image: 243 x 335 mm,243,335,NaN,mm,NaN,NaN,http://www.tate.org.uk/art/images/work/A/A00/A...,http://www.tate.org.uk/art/artworks/blake-the-...

In [32]:
df = pd.read_csv(csv_path,nrows=5,index_col='id',usecols=['id','artist'])

In [33]:
df

              artist
id
1035   Blake, Robert
1036   Blake, Robert
1037   Blake, Robert
1038   Blake, Robert
1039  Blake, William

In [34]:
# all thecolumns that we need
cols_to_use = ['id','artist','title','medium','year','acquisitionYear','height','width','units']

In [35]:
df = pd.read_csv(csv_path,usecols=cols_to_use,index_col='id')

/home/vijay/anaconda2/envs/py35/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2717: DtypeWarning: Columns (9,13) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [36]:
df[:3]

,artist,title,medium,year,acquisitionYear,width,height,units
id,,,,,,,,
1035,"Blake, Robert",A Figure Bowing before a Seated Old Man with h...,"Watercolour, ink, chalk and graphite on paper....",NaN,1922.0,394,419,mm
1036,"Blake, Robert","Two Drawings of Frightened Figures, Probably f...",Graphite on paper,NaN,1922.0,311,213,mm
1037,"Blake, Robert",The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785,1922.0,343,467,mm

In [37]:
# save to disk,for later use in a python script, it is native python fomrat for seralisation
df.to_pickle(os.path.join('..','df.pickle'))
#To serialize an object means to convert its state to a byte stream so that the byte stream can be
#reverted back into a copy of the object

In [38]:
#df.to_pickle('df.pickle')

In [39]:
# READING JSON in recursive sub directories

In [40]:
#from records it takes  alit of tuples in which each tuple represnts 1 record in df

In [41]:
records = [('Espresso',"$4"),('Flat white',"$10")]

In [42]:
pd.DataFrame.from_records(records)

            0    1
0    Espresso   $4
1  Flat white  $10

In [43]:
pd.DataFrame.from_records(records,columns=["coffee","price"])

       coffee price
0    Espresso    $4
1  Flat white   $10

In [44]:
dct = {"agem":[32,22],"agef":[33,23]} # unlike tuple,this is a column, that was a row

In [45]:
pd.DataFrame(dct)

   agef  agem
0    33    32
1    23    22

In [46]:
# reading json sub directoroies
#traverse folders to get json files
#find ways to read them so that pandas understands
#try to produce idential df as csv

### WRITING FULL CODE,creating pandas df from different sources and situation

In [47]:
KEYS_TO_USE = ['id','all_artists','title','medium','acquisitionYear','height','width','units']

def get_record_from_file(file_path,keys_to_use):
    """ Processing single json file and return a tuple containing specific fields."""
    with open(file_path) as artwork_file:
        content =  json.load(artwork_file)
        #print(content)
        #print("------------------")
        
    record = []
    for field in keys_to_use:
        record.append(content[field])
    return tuple(record)

In [48]:
get_record_from_file("collection/artworks/a/000/a00094-1731.json",KEYS_TO_USE)

(1731,
 'Sir Edward Coley Burne-Jones, Bt',
 'Study of a Male Figure for ‘Clerk Saunders’',
 'Graphite on paper',
 1927,
 '148',
 '297',
 'mm')

In [55]:
def read_artworks_from_json(keys_to_use):
    """ Taverse the directory with json files,for the first file in each directory call function for 
    processing single file and go to next directory"""
    
    JSON_ROOT = os.path.join('collection','artworks','a')
    
    artworks = []
    
    for root,_,files in os.walk(JSON_ROOT):
        for f in files:
            if f.endswith('json'):
                #print (os.path.join(root,f))
                record =  get_record_from_file(os.path.join(root,f),keys_to_use)
                print(root)
                artworks.append(record)
            break# make sure we visit only the first fiel in each dir
            
    df = pd.DataFrame.from_records(artworks,columns=keys_to_use,index='id')

    return df

In [56]:
read_artworks_from_json(KEYS_TO_USE)

collection/artworks/a/005
collection/artworks/a/001
collection/artworks/a/011
collection/artworks/a/000
collection/artworks/a/009
collection/artworks/a/017
collection/artworks/a/008
collection/artworks/a/003
collection/artworks/a/007
collection/artworks/a/002
collection/artworks/a/012
collection/artworks/a/004
collection/artworks/a/016
collection/artworks/a/006
collection/artworks/a/013
collection/artworks/a/010
collection/artworks/a/015
collection/artworks/a/014

,all_artists,title,medium,acquisitionYear,height,width,units
id,,,,,,,
7543,George Jones,[title not known],Watercolour and graphite on paper,1888,,,
1926,William Callow,"Rathaus, Hanover",Graphite on paper,1912,337,254,mm
9378,Joseph Mallord William Turner,"Inverary Castle and Town, Scotland, engraved b...",Etching and mezzotint on paper,1925,258,181,mm
1714,"Sir Edward Coley Burne-Jones, Bt",St Oswald,Charcoal and graphite on paper,1927,400,730,mm
14612,Joseph Mallord William Turner,"Frontispiece, engraved by J.C. Easling",Etching and mezzotint on paper,1925,265,188,mm
69866,George Jones,[title not known],Ink and graphite on paper,1888,,,
13920,Thomas Stothard,"Sketch for ‘The Pilgrimage to Canterbury’, wit...",Ink on paper,1891,190,114,mm
7407,George Jones,[title not known],Ink on paper,1888,,,
8552,Alphonse Legros,[title not known],Bronze,1912,,,
7261,George Jones,[title not known],Ink on paper,1888,,,
69423,George Jones,[title not known],Ink and watercolour on paper,1888,,,
7482,George Jones,[title not known],Ink on paper,1888,,,
69767,George Jones,[title not known],Ink and watercolour on paper,1888,,,
7670,George Jones,[title not known],"Ink, graphite and watercolour on paper",1888,,,
69510,George Jones,[title not known],Ink on paper,1888,,,
853,Sir Max Beerbohm,The Sole Remark Likely to Have Been Made by Be...,Graphite and watercolour on paper,1941,298,451,mm
69655,George Jones,[title not known],Watercolour on paper,1888,,,
69575,George Jones,[title not known],Ink and graphite on paper,1888,,,

In [57]:
# INDEXING,    FILTERS,CLEANING ASKING QUESTIONS
# HOW MANY DISTINCT ARTIST ARE IN THE DATASET?
#HOW MANY ARTWORK BY FRANCIS BACON ARE THERE?
#WHICH ARE THE ARTWORK WITH BIGGEST DIMENSION

In [58]:
df.dtypes

artist              object
title               object
medium              object
year                object
acquisitionYear    float64
width               object
height              object
units               object
dtype: object

In [59]:
df['artist'][:3] # single column returns series

id
1035    Blake, Robert
1036    Blake, Robert
1037    Blake, Robert
Name: artist, dtype: object

In [60]:
df[['artist','medium']][:3] # more than 1 col returns df

             artist                                             medium
id
1035  Blake, Robert  Watercolour, ink, chalk and graphite on paper....
1036  Blake, Robert                                  Graphite on paper
1037  Blake, Robert        Graphite on paper. Verso: graphite on paper

In [61]:
# DEMO
import pandas as pd
import os

In [62]:
# Let's load the data for the first time
df = pd.read_pickle(os.path.join('..','df.pickle'))
#DEMO 1
artist = df['artist']
pd.unique(artist)

array(['Blake, Robert', 'Blake, William', 'Richmond, George', ...,
       'Sterne, Hedda', 'P-Orridge, Genesis', 'Brunias, Agostino'], dtype=object)

In [63]:
len(pd.unique(artist))

3336

In [64]:
(df['artist']=='Blake, Robert')[0:3]

id
1035    True
1036    True
1037    True
Name: artist, dtype: bool

In [65]:
s= df['artist']=='Blake, Robert'

In [66]:
s.value_counts()

False    69197
True         4
Name: artist, dtype: int64

In [67]:
artist_counts = df['artist'].value_counts()

In [68]:
artist_counts[:5]

Turner, Joseph Mallord William    39389
Jones, George                      1046
Moore, Henry, OM, CH                623
Daniell, William                    612
Beuys, Joseph                       578
Name: artist, dtype: int64

In [69]:
artist_counts['Blake, Robert']

4

## INDEXIG THE RIGHT WAY

In [84]:
#CONSISTENT WAY OF DATA SELECTION, ONE WHICH IS EASY
# 2 ATTRIBUTES loc and iloc
# these allow to crunch out data in an easy and consistent way
# loc by label and iloc by position (label is what inside pandas index object,the there are column labels 2)
#each label has
# has index starting 0

In [85]:
df.loc[1035,'artist'] # row indexer,column indexer

'Blake, Robert'

In [86]:
df.loc[s,'artist']

id
1035    Blake, Robert
1036    Blake, Robert
1037    Blake, Robert
1038    Blake, Robert
Name: artist, dtype: object

In [87]:
df.loc[s,:]

,artist,title,medium,year,acquisitionYear,width,height,units
id,,,,,,,,
1035,"Blake, Robert",A Figure Bowing before a Seated Old Man with h...,"Watercolour, ink, chalk and graphite on paper....",NaN,1922.0,394,419,mm
1036,"Blake, Robert","Two Drawings of Frightened Figures, Probably f...",Graphite on paper,NaN,1922.0,311,213,mm
1037,"Blake, Robert",The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785,1922.0,343,467,mm
1038,"Blake, Robert",Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,1922.0,318,394,mm

In [74]:
# now iloc select by position
df.iloc[2,5] # row index,column index

'343'

In [88]:
df[:4]

,artist,title,medium,year,acquisitionYear,width,height,units
id,,,,,,,,
1035,"Blake, Robert",A Figure Bowing before a Seated Old Man with h...,"Watercolour, ink, chalk and graphite on paper....",NaN,1922.0,394,419,mm
1036,"Blake, Robert","Two Drawings of Frightened Figures, Probably f...",Graphite on paper,NaN,1922.0,311,213,mm
1037,"Blake, Robert",The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785,1922.0,343,467,mm
1038,"Blake, Robert",Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,1922.0,318,394,mm

In [90]:
df.iloc[2:4,1]

id
1037    The Preaching of Warning. Verso: An Old Man En...
1038       Six Drawings of Figures with Outstretched Arms
Name: title, dtype: object

In [91]:
df.iloc[2:12,1:5]

,title,medium,year,acquisitionYear
id,,,,
1037,The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785,1922.0
1038,Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,1922.0
1039,The Circle of the Lustful: Francesca da Rimini...,Line engraving on paper,1826,1919.0
1040,Ciampolo the Barrator Tormented by the Devils,Line engraving on paper,1826,1919.0
1041,The Baffled Devils Fighting,Line engraving on paper,1826,1919.0
1042,The Six-Footed Serpent Attacking Agnolo Brunel...,Line engraving on paper,1826,1919.0
1043,The Serpent Attacking Buoso Donati,Line engraving on paper,1826,1919.0
1044,The Pit of Disease: The Falsifiers,Line engraving on paper,1826,1919.0
1045,Dante Striking against Bocca Degli Abati,Line engraving on paper,1826,1919.0
1046,Job and his Family,Line engraving on paper,1828,1919.0

In [78]:
df.iloc[2:12,[1,2,3,4]]

,title,medium,year,acquisitionYear
id,,,,
1037,The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785,1922.0
1038,Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,1922.0
1039,The Circle of the Lustful: Francesca da Rimini...,Line engraving on paper,1826,1919.0
1040,Ciampolo the Barrator Tormented by the Devils,Line engraving on paper,1826,1919.0
1041,The Baffled Devils Fighting,Line engraving on paper,1826,1919.0
1042,The Six-Footed Serpent Attacking Agnolo Brunel...,Line engraving on paper,1826,1919.0
1043,The Serpent Attacking Buoso Donati,Line engraving on paper,1826,1919.0
1044,The Pit of Disease: The Falsifiers,Line engraving on paper,1826,1919.0
1045,Dante Striking against Bocca Degli Abati,Line engraving on paper,1826,1919.0
1046,Job and his Family,Line engraving on paper,1828,1919.0

## DEMO3

In [79]:
df.loc[1035,'artist']

'Blake, Robert'

In [80]:
df.iloc[0,0]

'Blake, Robert'

In [81]:
df.iloc[0,:]

artist                                                 Blake, Robert
title              A Figure Bowing before a Seated Old Man with h...
medium             Watercolour, ink, chalk and graphite on paper....
year                                                             NaN
acquisitionYear                                                 1922
width                                                            394
height                                                           419
units                                                             mm
Name: 1035, dtype: object

In [99]:
df.iloc[0:2,0:2] # slicing : first 2 rows and 1st two col

             artist                                              title
id
1035  Blake, Robert  A Figure Bowing before a Seated Old Man with h...
1036  Blake, Robert  Two Drawings of Frightened Figures, Probably f...

In [100]:
#try multiplication
pd.to_numeric(df['width'][2:10])*pd.to_numeric(df['height'][2:10]) # we need to do this because some values are test henc e
# hence of type object

id
1037    160181.0
1038    125292.0
1039     81405.0
1040     81120.0
1041     80828.0
1042     83640.0
1043     80735.0
1044     82620.0
dtype: float64

In [101]:
# another way
df[['width', 'height']] = df[['width', 'height']][0:100].astype(float)
df['width'][0:5]*df['height'][0:5]

id
1035    165086.0
1036     66243.0
1037    160181.0
1038    125292.0
1039     81405.0
dtype: float64

In [102]:
df[['width', 'height']][1:10]

      width  height
id
1036  311.0   213.0
1037  343.0   467.0
1038  318.0   394.0
1039  243.0   335.0
1040  240.0   338.0
1041  242.0   334.0
1042  246.0   340.0
1043  241.0   335.0
1044  243.0   340.0

In [103]:
# professional way
df['width'].sort_values()[0:5] # see data types are not number

id
1068     92.0
1716    101.0
1733    105.0
1070    112.0
1069    112.0
Name: width, dtype: float64

In [104]:
df['width'].sort_values().head(5)

id
1068     92.0
1716    101.0
1733    105.0
1070    112.0
1069    112.0
Name: width, dtype: float64

In [105]:
df['width'].sort_values().tail(5)

id
122960   NaN
122961   NaN
121181   NaN
112306   NaN
127035   NaN
Name: width, dtype: float64

In [106]:
# pd.to_numeric(df['width']) # give error ValueError: Unable to parse string "(upper):" at position 1839
pd.to_numeric(df['width'],errors='coerce')[0:5] # on error please coerce value to nan(non a number)
# hurray this has numeric d type float 64

id
1035    394.0
1036    311.0
1037    343.0
1038    318.0
1039    243.0
Name: width, dtype: float64

In [107]:
# replacing width and height with new colum
df.loc[:,'width'] = pd.to_numeric(df['width'],errors='coerce')

In [108]:
df.loc[:,'height'] = pd.to_numeric(df['height'],errors='coerce')

In [109]:
df['width'][0:3] * df['height'][0:3] # now it works

id
1035    165086.0
1036     66243.0
1037    160181.0
dtype: float64

In [110]:
# adding a new column to df
area = df['width'][0:3] * df['height'][0:3]

In [111]:
df = df.assign(area=area)

In [112]:
df.dtypes # new column s added

artist              object
title               object
medium              object
year                object
acquisitionYear    float64
width              float64
height             float64
units               object
area               float64
dtype: object

In [113]:
df['area'].max()

165086.0

In [114]:
df['area'].idxmax() # gives index of max row

1035

In [115]:
#now that we have row lable we can use loc
df.loc[df['area'].idxmax(),:]

artist                                                 Blake, Robert
title              A Figure Bowing before a Seated Old Man with h...
medium             Watercolour, ink, chalk and graphite on paper....
year                                                             NaN
acquisitionYear                                                 1922
width                                                            394
height                                                           419
units                                                             mm
area                                                          165086
Name: 1035, dtype: object

In [117]:
## group
#iterating through groups
# speed up work flow with groups
# use cases:aggreagtion,filtering,transformaton( if a value is missing do a group by and substitute the
#most common value in the group)

In [119]:
type(df)

pandas.core.frame.DataFrame

In [131]:
df_grpd = df.groupby('artist')

In [132]:
type(df_grpd)

pandas.core.groupby.DataFrameGroupBy

In [135]:
#iterate over artist group
#FInd the date of first acquisition for each artist
#Fill some missing values

In [156]:
small_df = df.iloc[49980:50019,:].copy()

In [164]:
small_df

,artist,title,medium,year,acquisitionYear,width,height,units,area
id,,,,,,,,,
16412,Wols,[no title],Etching on paper,1937,1983.0,NaN,NaN,mm,NaN
16413,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16414,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16415,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16416,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16417,Wols,[no title],Etching on paper,1937,1983.0,NaN,NaN,mm,NaN
16418,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16419,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16420,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16421,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16422,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16423,Wols,[no title],Etching on paper,1937,1983.0,NaN,NaN,mm,NaN
16424,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16425,Wols,[no title],Etching on paper,1937,1983.0,NaN,NaN,mm,NaN
16426,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16427,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16428,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16429,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16430,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16431,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16432,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16433,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16434,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16435,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16436,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16437,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16438,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16439,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16440,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
16441,Wols,[no title],Etching and drypoint on paper,1937,1983.0,NaN,NaN,mm,NaN
4704,"Frost, Sir Terry",Blue Moon,Lithograph on paper,1952,1983.0,NaN,NaN,mm,NaN
4705,"Frost, Sir Terry",Boat Shapes,Linocut on paper,1952,1983.0,NaN,NaN,mm,NaN
4706,"Frost, Sir Terry",Boat Shapes,Linocut on paper,1954,1983.0,NaN,NaN,mm,NaN
4707,"Frost, Sir Terry",Boat Shapes,Linocut on paper,1954,1983.0,NaN,NaN,mm,NaN
4708,"Frost, Sir Terry",Leeds,Drypoint on paper,1956,1983.0,NaN,NaN,mm,NaN
4709,"Frost, Sir Terry","Camping, Anduze",Etching on paper,1979,1983.0,NaN,NaN,mm,NaN
4710,"Frost, Sir Terry","Umea, Sweden",Etching on paper,1979,1983.0,NaN,NaN,NaN,NaN
4711,"Frost, Sir Terry",Self-Portrait,Etching on paper,1980,1983.0,NaN,NaN,mm,NaN
11838,"Phillips, Esq Tom",[colophon],Etching on paper,1979,1983.0,NaN,NaN,mm,NaN

In [184]:
grouped = small_df.groupby('artist')
type(grouped)

pandas.core.groupby.DataFrameGroupBy

In [185]:
for name,group_df in grouped:
    print(name)
    print(group_df)
    break # take on 1st one

Frost, Sir Terry
                artist            title               medium  year  \
id
4704  Frost, Sir Terry        Blue Moon  Lithograph on paper  1952
4705  Frost, Sir Terry      Boat Shapes     Linocut on paper  1952
4706  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954
4707  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954
4708  Frost, Sir Terry            Leeds    Drypoint on paper  1956
4709  Frost, Sir Terry  Camping, Anduze     Etching on paper  1979
4710  Frost, Sir Terry     Umea, Sweden     Etching on paper  1979
4711  Frost, Sir Terry    Self-Portrait     Etching on paper  1980

      acquisitionYear  width  height units  area
id
4704           1983.0    NaN     NaN    mm   NaN
4705           1983.0    NaN     NaN    mm   NaN
4706           1983.0    NaN     NaN    mm   NaN
4707           1983.0    NaN     NaN    mm   NaN
4708           1983.0    NaN     NaN    mm   NaN
4709           1983.0    NaN     NaN    mm   NaN
4710           1983.0    NaN     NaN   NaN   NaN
4711           1983.0    NaN     NaN    mm   NaN

In [186]:
for name ,group_df in small_df.groupby('artist'):
    min_year = group_df['acquisitionYear'].min()
    #print(name)
    #print(min_year)
    print("{} : {}".format(name,min_year))  # find min year for reach

Frost, Sir Terry : 1983.0
Phillips, Esq Tom : 1983.0
Wols : 1983.0

In [187]:
# transformation

In [192]:
def fill_values(series):
    values_counted = series.value_counts()
    if values_counted.empty:
        return series
    most_frequent = values_counted.index[0]
    new_medium = series.fillna(most_frequent)
    return new_medium

In [193]:
def transform_df(source_df):
    group_dfs= []
    for name,group_df in source_df.groupby('artist'):
        filled_df = group_df.copy()
        filled_df.loc[:'medium'] = fill_values(group_df['medium'])
        group_dfs.append(filled_df)
        
        new_df = pd.concat(group_dfs)
        
        return new_df

In [194]:
filled_df = transform_df(small_df)

ValueError: Must have equal len keys and value when setting with an iterable

In [195]:
#PERFORM AGGREGATION,TRANSFORMATION, AND FILTERING USING BUILTIN METHODS

In [202]:
#TRANSFORM
grouped_mediums = small_df.groupby('artist')['medium']
#grouped_mediums.head(10)
small_df.loc[:,'medium'] = grouped_mediums.transform(fill_values)

In [206]:
#MIN
df.groupby('artist').agg(np.min) # or min() using np gives performance improvement

,title,acquisitionYear,width,height,area
artist,,,,,
?British School,"Portrait of a Gentleman, probably of the West ...",1927.0,NaN,NaN,NaN
"Abakanowicz, Magdalena",Abakan Orange,2009.0,NaN,NaN,NaN
"Abbey, Edwin Austin",Illustration to ‘Judith Shakespeare’,1924.0,NaN,NaN,NaN
"Abbott, Berenice",Dinty Moore Antiques,2010.0,NaN,NaN,NaN
"Abbott, Lemuel Francis","Henry Byne, of Carshalton",1885.0,NaN,NaN,NaN
"Abrahams, Ivor",A Dream Within a Dream,1975.0,NaN,NaN,NaN
Absalon,Assassinations,1997.0,NaN,NaN,NaN
"Abts, Tomma",Noeme,2006.0,NaN,NaN,NaN
"Acconci, Vito",3 Flags for 1 Space and 6 Regions,1982.0,NaN,NaN,NaN
"Ackling, Roger",Five Sunsets in One Hour,1983.0,NaN,NaN,NaN
"Ackroyd, Norman",1st Millbank Print,1975.0,NaN,NaN,NaN
"Adam, Robert","A Chasm, with Figures",1996.0,NaN,NaN,NaN
"Adams, Harry William",Winter’s Sleep,1900.0,NaN,NaN,NaN
"Adams, Norman",Christ’s Cross and Adam’s Tree,1967.0,NaN,NaN,NaN
"Adams, Robert",Figure,1962.0,NaN,NaN,NaN
"Adeney, Bernard","Toy Sailing Boats, the Round Pond",1931.0,NaN,NaN,NaN
"Adler, Jankel",No Man’s Land,1953.0,NaN,NaN,NaN
"Adshead, Mary",Morning after the Flood,1997.0,NaN,NaN,NaN
"Adzak, Roy",Cut Bottle Relief,1966.0,NaN,NaN,NaN
Afro,The Struggle,1955.0,NaN,NaN,NaN
"Agar, Eileen",Angel of Anarchy,1962.0,NaN,NaN,NaN
"Agasse, Jacques Laurent",Lord Rivers’s Groom Leading a Chestnut Hunter ...,1979.0,NaN,NaN,NaN
"Ahtila, Eija-Liisa",Consolation Service,2001.0,NaN,NaN,NaN
"Ai, Weiwei",Sunflower Seeds,2008.0,NaN,NaN,NaN
"Aitchison, Craigie",Africa,1964.0,NaN,NaN,NaN
"Ajmone, Giuseppe",Autumn,1960.0,NaN,NaN,NaN
"Aksel, Erdag",Reflection of Craft,2011.0,NaN,NaN,NaN
"Al-Ani, Jananne",The Visit,2009.0,NaN,NaN,NaN
"Albers, Josef",Beta,1965.0,NaN,NaN,NaN
"Albright, Ivan",Josephine Medill Paterson Albright,1978.0,NaN,NaN,NaN
...,...,...,...,...,...
"Yass, Catherine",Bankside: Cherrypicker,1996.0,NaN,NaN,NaN
"Yeames, William Frederick",Amy Robsart,1877.0,NaN,NaN,NaN
"Yeats, Jack Butler",A Rose Among Many Waters,1925.0,NaN,NaN,NaN
"Yhap, Laetitia",Michael Balling Up Old Net,1984.0,NaN,NaN,NaN
"Yiadom-Boakye, Lynette",10pm Saturday,2012.0,NaN,NaN,NaN
"Young, Carey","Body Techniques (after A Line in Ireland, Rich...",2006.0,NaN,NaN,NaN
"Young, Robert",Sounds Inside,1975.0,NaN,NaN,NaN
"Young-Hae Chang Heavy Industries (Young-Hae Chang, Marc Voge)",TEASER,2012.0,NaN,NaN,NaN
"Young-Hunter, John",My Lady’s Garden,1899.0,NaN,NaN,NaN
"Yuon, Konstantin",The Monastery at Zagorsk,1964.0,NaN,NaN,NaN
"Yvaral, Jean-Pierre",Kinetic Relief - Optical Acceleration,1964.0,NaN,NaN,NaN
"Zaatari, Akram",A fisherman with his daughters. Saqqa family h...,2008.0,NaN,NaN,NaN
"Zack, Leon",Painting,1959.0,NaN,NaN,NaN
"Zadkine, Ossip",Acrobat,1954.0,NaN,NaN,NaN
"Zakanitch, Robert Rahway",Double Geese Mountain,2004.0,NaN,NaN,NaN
"Zao, Wou-ki",Before the Storm,1958.0,NaN,NaN,NaN
"Zhang, Enli",Bucket 3,2011.0,NaN,NaN,NaN
"Ziegler, Toby",The Hedonistic Imperative (2nd version),2006.0,NaN,NaN,NaN
"Zipp, Thomas",achtung,2007.0,NaN,NaN,NaN
"Zittel, Andrea",A-Z Comfort Unit with Special Comfort Features...,1996.0,NaN,NaN,NaN
"Zmijewski, Artur",Democracies,2010.0,NaN,NaN,NaN
"Zoffany, Johan",A Florentine Fruit Stall,1896.0,NaN,NaN,NaN
"Zorio, Gilberto",Hatred,2009.0,NaN,NaN,NaN
"Zox, Larry",Orange Time,1968.0,NaN,NaN,NaN
"Zuccarelli, Francesco",A Landscape with the Story of Cadmus Killing t...,1985.0,NaN,NaN,NaN
"Zuloaga, Ignacio",View of the Escorial,1923.0,NaN,NaN,NaN
"Zyw, Aleksander",Light,1962.0,NaN,NaN,NaN
"di Suvero, Mark",Tetra,2004.0,NaN,NaN,NaN
"van Elk, Ger",Lunch II,1980.0,NaN,NaN,NaN
"Štyrský, Jindrich",Untitled,2007.0,NaN,NaN,NaN

In [207]:
df.groupby('artist').min()

,title,acquisitionYear,width,height,area
artist,,,,,
?British School,"Portrait of a Gentleman, probably of the West ...",1927.0,NaN,NaN,NaN
"Abakanowicz, Magdalena",Abakan Orange,2009.0,NaN,NaN,NaN
"Abbey, Edwin Austin",Illustration to ‘Judith Shakespeare’,1924.0,NaN,NaN,NaN
"Abbott, Berenice",Dinty Moore Antiques,2010.0,NaN,NaN,NaN
"Abbott, Lemuel Francis","Henry Byne, of Carshalton",1885.0,NaN,NaN,NaN
"Abrahams, Ivor",A Dream Within a Dream,1975.0,NaN,NaN,NaN
Absalon,Assassinations,1997.0,NaN,NaN,NaN
"Abts, Tomma",Noeme,2006.0,NaN,NaN,NaN
"Acconci, Vito",3 Flags for 1 Space and 6 Regions,1982.0,NaN,NaN,NaN
"Ackling, Roger",Five Sunsets in One Hour,1983.0,NaN,NaN,NaN
"Ackroyd, Norman",1st Millbank Print,1975.0,NaN,NaN,NaN
"Adam, Robert","A Chasm, with Figures",1996.0,NaN,NaN,NaN
"Adams, Harry William",Winter’s Sleep,1900.0,NaN,NaN,NaN
"Adams, Norman",Christ’s Cross and Adam’s Tree,1967.0,NaN,NaN,NaN
"Adams, Robert",Figure,1962.0,NaN,NaN,NaN
"Adeney, Bernard","Toy Sailing Boats, the Round Pond",1931.0,NaN,NaN,NaN
"Adler, Jankel",No Man’s Land,1953.0,NaN,NaN,NaN
"Adshead, Mary",Morning after the Flood,1997.0,NaN,NaN,NaN
"Adzak, Roy",Cut Bottle Relief,1966.0,NaN,NaN,NaN
Afro,The Struggle,1955.0,NaN,NaN,NaN
"Agar, Eileen",Angel of Anarchy,1962.0,NaN,NaN,NaN
"Agasse, Jacques Laurent",Lord Rivers’s Groom Leading a Chestnut Hunter ...,1979.0,NaN,NaN,NaN
"Ahtila, Eija-Liisa",Consolation Service,2001.0,NaN,NaN,NaN
"Ai, Weiwei",Sunflower Seeds,2008.0,NaN,NaN,NaN
"Aitchison, Craigie",Africa,1964.0,NaN,NaN,NaN
"Ajmone, Giuseppe",Autumn,1960.0,NaN,NaN,NaN
"Aksel, Erdag",Reflection of Craft,2011.0,NaN,NaN,NaN
"Al-Ani, Jananne",The Visit,2009.0,NaN,NaN,NaN
"Albers, Josef",Beta,1965.0,NaN,NaN,NaN
"Albright, Ivan",Josephine Medill Paterson Albright,1978.0,NaN,NaN,NaN
...,...,...,...,...,...
"Yass, Catherine",Bankside: Cherrypicker,1996.0,NaN,NaN,NaN
"Yeames, William Frederick",Amy Robsart,1877.0,NaN,NaN,NaN
"Yeats, Jack Butler",A Rose Among Many Waters,1925.0,NaN,NaN,NaN
"Yhap, Laetitia",Michael Balling Up Old Net,1984.0,NaN,NaN,NaN
"Yiadom-Boakye, Lynette",10pm Saturday,2012.0,NaN,NaN,NaN
"Young, Carey","Body Techniques (after A Line in Ireland, Rich...",2006.0,NaN,NaN,NaN
"Young, Robert",Sounds Inside,1975.0,NaN,NaN,NaN
"Young-Hae Chang Heavy Industries (Young-Hae Chang, Marc Voge)",TEASER,2012.0,NaN,NaN,NaN
"Young-Hunter, John",My Lady’s Garden,1899.0,NaN,NaN,NaN
"Yuon, Konstantin",The Monastery at Zagorsk,1964.0,NaN,NaN,NaN
"Yvaral, Jean-Pierre",Kinetic Relief - Optical Acceleration,1964.0,NaN,NaN,NaN
"Zaatari, Akram",A fisherman with his daughters. Saqqa family h...,2008.0,NaN,NaN,NaN
"Zack, Leon",Painting,1959.0,NaN,NaN,NaN
"Zadkine, Ossip",Acrobat,1954.0,NaN,NaN,NaN
"Zakanitch, Robert Rahway",Double Geese Mountain,2004.0,NaN,NaN,NaN
"Zao, Wou-ki",Before the Storm,1958.0,NaN,NaN,NaN
"Zhang, Enli",Bucket 3,2011.0,NaN,NaN,NaN
"Ziegler, Toby",The Hedonistic Imperative (2nd version),2006.0,NaN,NaN,NaN
"Zipp, Thomas",achtung,2007.0,NaN,NaN,NaN
"Zittel, Andrea",A-Z Comfort Unit with Special Comfort Features...,1996.0,NaN,NaN,NaN
"Zmijewski, Artur",Democracies,2010.0,NaN,NaN,NaN
"Zoffany, Johan",A Florentine Fruit Stall,1896.0,NaN,NaN,NaN
"Zorio, Gilberto",Hatred,2009.0,NaN,NaN,NaN
"Zox, Larry",Orange Time,1968.0,NaN,NaN,NaN
"Zuccarelli, Francesco",A Landscape with the Story of Cadmus Killing t...,1985.0,NaN,NaN,NaN
"Zuloaga, Ignacio",View of the Escorial,1923.0,NaN,NaN,NaN
"Zyw, Aleksander",Light,1962.0,NaN,NaN,NaN
"di Suvero, Mark",Tetra,2004.0,NaN,NaN,NaN
"van Elk, Ger",Lunch II,1980.0,NaN,NaN,NaN
"Štyrský, Jindrich",Untitled,2007.0,NaN,NaN,NaN

In [211]:
grouped_titles = df.groupby('title')
title_counts = grouped_titles.size().sort_values(ascending=False)

condition = lambda x: len(x.index) >1
dup_titles_df = grouped_titles.filter(condition)
dup_titles_df.sort_values('title',inplace=True)

/home/vijay/anaconda2/envs/py35/lib/python3.5/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [509]:
dct = {'ids':[1,2,3,4,5,6,7,8,9],'name':['vijay','sujay','vijay','sujay','vijay','sujay','vijay','vijay','sujay'],'sales':[2230,3500,1400,1123,1122,1456,1500,1400,0]}

In [510]:
dct

{'ids': [1, 2, 3, 4, 5, 6, 7, 8, 9],
 'name': ['vijay',
  'sujay',
  'vijay',
  'sujay',
  'vijay',
  'sujay',
  'vijay',
  'vijay',
  'sujay'],
 'sales': [2230, 3500, 1400, 1123, 1122, 1456, 1500, 1400, 0]}

In [511]:
pdf =pd.DataFrame.from_records(dct,index='ids')

In [512]:
pdf.dtypes

name     object
sales     int64
dtype: object

In [513]:
pdf.groupby('name').agg(np.min)

       sales
name
sujay      0
vijay   1122

In [372]:
groupby_sales = pdf.groupby('name')['sales']

In [514]:
groupby_sales.head(1)

ids
1    2230
2    3500
Name: sales, dtype: int64

In [374]:
pdf.loc[:,'sales'] = groupby_sales.transform(fill_values)
#pdf.loc[:,'sales'] = groupby_sales.fillna(100)
#pdf.loc[:,'sales']

In [515]:
pdf

      name  sales
ids
1    vijay   2230
2    sujay   3500
3    vijay   1400
4    sujay   1123
5    vijay   1122
6    sujay   1456
7    vijay   1500
8    vijay   1400
9    sujay      0

In [376]:
def fill_values(series):
    values_counted = series.value_counts()
    if values_counted.empty:
        return series
    most_frequent = values_counted.index[0]
    new_medium = series.fillna(most_frequent)
    return new_medium

In [377]:
def transform_df(source_df):
    group_dfs= []
    for name,group_df in source_df.groupby('name'):
        filled_df = group_df.copy()
        filled_df.loc[:'sales'] = fill_values(group_df['sales'])
        group_dfs.append(filled_df)
        
        new_df = pd.concat(group_dfs)
        
        return new_df

In [378]:
filled_df = transform_df(pdf)
#pdf

ValueError: Must have equal len keys and value when setting with an iterable

In [379]:
pdf.groupby('name').agg('sum')

       sales
name
sujay   6079
vijay   7652

In [435]:

pdf['sales']

ids
1       2230
2       3500
3       1400
4       1123
5       1122
6       1456
7       1500
8       1400
9          0
2230    4460
3500    7000
1400    2800
1123    2246
1122    2244
1456    2912
1500    3000
0          0
Name: sales, dtype: int64

In [441]:
pdf2 = pdf.groupby('name')
for name in pdf2:
    print (name)

('sujay',       name  sales
ids
2    sujay   3500
4    sujay   1123
6    sujay   1456
9    sujay      0)
('vijay',       name  sales
ids
1    vijay   2230
3    vijay   1400
5    vijay   1122
7    vijay   1500
8    vijay   1400)

In [516]:
sls_srs=pdf['sales'] #1

In [471]:
type(sls_srs)

pandas.core.series.Series

In [517]:
def blowup_series(sls_srs): #2
    lst = []
    j=0
    for i in sls_srs:
        lst.append( i*2)
        sls_srs2 = pd.Series(lst)
    return sls_srs2

In [518]:
sls_srs2 =blowup_series(sls_srs) #3

In [519]:
sls_srs2

0    4460
1    7000
2    2800
3    2246
4    2244
5    2912
6    3000
7    2800
8       0
dtype: int64

In [496]:
sls2=pd.DataFrame(sls_srs2,columns=['sales2'])

In [497]:
sls2

   sales2
0    4460
1    7000
2    2800
3    2246
4    2244
5    2912
6    3000
7    2800
8       0

In [526]:
dct = {'ids':[1,2,3,4,5,6,7,8,9],'name':['vijay','sujay','vijay','sujay','vijay','sujay','vijay','vijay','sujay'],'sales':[2230,3500,1400,1123,1122,1456,1500,1400,0]}
pdf =pd.DataFrame.from_records(dct,index='ids')

In [527]:
sls_srs=pdf['sales'] #1

In [528]:
def blowup_series(sls_srs): #2
    lst = []
    j=0
    for i in sls_srs:
        lst.append( i*2)
        sls_srs2 = pd.Series(lst)
    return sls_srs2

In [529]:
sls_srs2 =blowup_series(sls_srs) #3

In [530]:
pdf['sales2'] = sls_srs2  #4

In [531]:
pdf

      name  sales  sales2
ids
1    vijay   2230  7000.0
2    sujay   3500  2800.0
3    vijay   1400  2246.0
4    sujay   1123  2244.0
5    vijay   1122  2912.0
6    sujay   1456  3000.0
7    vijay   1500  2800.0
8    vijay   1400     0.0
9    sujay      0     NaN

In [533]:
pdf.dropna(axis=0, how='any', thresh=None, subset=['sales2'], inplace=False) #5

      name  sales  sales2
ids
1    vijay   2230  7000.0
2    sujay   3500  2800.0
3    vijay   1400  2246.0
4    sujay   1123  2244.0
5    vijay   1122  2912.0
6    sujay   1456  3000.0
7    vijay   1500  2800.0
8    vijay   1400     0.0

In [539]:
pdf['sales3'] = pdf['sales']*2

In [542]:
pdf.dropna()

      name  sales  sales2  sales3
ids
1    vijay   2230  7000.0    4460
2    sujay   3500  2800.0    7000
3    vijay   1400  2246.0    2800
4    sujay   1123  2244.0    2246
5    vijay   1122  2912.0    2244
6    sujay   1456  3000.0    2912
7    vijay   1500  2800.0    3000
8    vijay   1400     0.0    2800

In [546]:
(pdf['sales3']>3000)

ids
1     True
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: sales3, dtype: bool

In [552]:
fltr_cond=pdf['sales3']>3000
pdf[fltr_cond]

      name  sales  sales2  sales3
ids
1    vijay   2230  7000.0    4460
2    sujay   3500  2800.0    7000

In [568]:
#some more operations
%timeit np.array(pdf['sales'][0:-1],np.float)/np.array(pdf['sales'][1:],np.float)

/home/vijay/anaconda2/envs/py35/lib/python3.5/site-packages/ipykernel_launcher.py:257: RuntimeWarning: divide by zero encountered in true_divide

The slowest run took 33.53 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 3: 159 µs per loop

In [570]:
%timeit pdf['sales'][:-1]/pdf['sales'][1:]-1

The slowest run took 8.58 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 3: 773 µs per loop

In [571]:
pdf['sales']

      name  sales  sales2  sales3
ids
1    vijay   2230  7000.0    4460
2    sujay   3500  2800.0    7000
3    vijay   1400  2246.0    2800
4    sujay   1123  2244.0    2246
5    vijay   1122  2912.0    2244
6    sujay   1456  3000.0    2912
7    vijay   1500  2800.0    3000
8    vijay   1400     0.0    2800
9    sujay      0     NaN       0

In [576]:
pdf.drop(9) # drops 9th id

      name  sales  sales2  sales3
ids
1    vijay   2230  7000.0    4460
2    sujay   3500  2800.0    7000
3    vijay   1400  2246.0    2800
4    sujay   1123  2244.0    2246
5    vijay   1122  2912.0    2244
6    sujay   1456  3000.0    2912
7    vijay   1500  2800.0    3000
8    vijay   1400     0.0    2800

In [580]:
# drop column /variable
pdf =pdf.drop('sales3', axis=1)

In [581]:
pdf

      name  sales  sales2
ids
1    vijay   2230  7000.0
2    sujay   3500  2800.0
3    vijay   1400  2246.0
4    sujay   1123  2244.0
5    vijay   1122  2912.0
6    sujay   1456  3000.0
7    vijay   1500  2800.0
8    vijay   1400     0.0
9    sujay      0     NaN

In [600]:
# iterate over pandas df,avoid
for index,row in pdf.iterrows():
    if row['name'] == 'vijay':
        print("{},{}".format(row['name'], row['sales']))

vijay,2230
vijay,1400
vijay,1122
vijay,1500
vijay,1400